ДО_для_разработки/src/Catalogs/ШаблоныРегистрации/ШаблоныРегистрации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныРегистрации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <comment>Важность задач точки действия Выполнить для исполнителя</comment>
    <type>
      <types>EnumRef.ВариантыВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУстановкиСрокаИсполнения</name>
    <type>
      <types>EnumRef.ВариантыУстановкиСрокаИсполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУстановкиСрокаОбработкиРезультатов</name>
    <type>
      <types>EnumRef.ВариантыУстановкиСрокаИсполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецШаблона</name>
    <type>
      <types>BusinessProcessRef.КомплексныйПроцесс</types>
      <types>CatalogRef.ШаблоныКомплексныхБизнесПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьНаименованиеПредмета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ПолныеРоли</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныйШаблон</name>
    <type>
      <types>CatalogRef.ШаблоныРегистрации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИтераций</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомплексныйПроцесс</name>
    <type>
      <types>BusinessProcessRef.КомплексныйПроцесс</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБизнесПроцесса</name>
    <comment>Описание поручения</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияМинуты</name>
    <comment>Срок исполнения для исполнителя</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияПроцесса</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполненияЧасы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОбработкиРезультатов</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОбработкиРезультатовДни</name>
    <comment>Срок обработки результатов автором</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОбработкиРезультатовМинуты</name>
    <comment>Срок обработки результатов автором</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОбработкиРезультатовЧасы</name>
    <comment>Срок обработки результатов автором</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокОтложенногоСтарта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрудозатратыПланИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИсполнитель</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПерсональныйШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСрокИсполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСрокИсполненияЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонВКомплексномПроцессе</name>
    <comment>Показывает, что данный шаблон бизнес-процесса используется в комплексном процессе</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предметы</name>
    <attributes>
      <name>РольПредмета</name>
      <type>
        <types>EnumRef.РолиПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредмета</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредметаОснование</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>Предмет</name>
      <type>
        <types>CatalogRef.ТемыОбсуждений</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.Проекты</types>
        <types>DocumentRef.ВходящееПисьмо</types>
        <types>DocumentRef.ИсходящееПисьмо</types>
        <types>CatalogRef.Файлы</types>
        <types>CatalogRef.ВходящиеДокументы</types>
        <types>DocumentRef.Бронь</types>
        <types>CatalogRef.ВнутренниеДокументы</types>
        <types>CatalogRef.СообщенияОбсуждений</types>
        <types>CatalogRef.ИсходящиеДокументы</types>
        <types>CatalogRef.Мероприятия</types>
        <types>CatalogRef.ПроектныеЗадачи</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонОснование</name>
      <type>
        <types>CatalogRef.ШаблоныИсходящихДокументов</types>
        <types>CatalogRef.Файлы</types>
        <types>String</types>
        <types>CatalogRef.ШаблоныВнутреннихДокументов</types>
        <types>CatalogRef.ШаблоныВходящихДокументов</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредметыЗадач</name>
    <attributes>
      <name>ТочкаМаршрута</name>
      <type>
        <types>BusinessProcessRoutePointRef.Регистрация</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредмета</name>
      <type>
        <types>CatalogRef.ИменаПредметов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательноеЗаполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УсловияЗапретаВыполнения</name>
    <attributes>
      <name>Условие</name>
      <type>
        <types>CatalogRef.УсловияЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстПредупреждения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ДО_для_разработки/src/Catalogs/ШаблоныРегистрации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет что заполнены поля шаблона
Функция ПолучитьСписокНезаполненныхПолейНеобходимыхДляСтарта() Экспорт
	
	МассивПолей = Новый Массив;

	Если Не ЗначениеЗаполнено(Исполнитель) Тогда
		МассивПолей.Добавить("Исполнитель");
	КонецЕсли;	
	
	Возврат МассивПолей;
	
КонецФункции	

//Формирует текстовое представление бизнес-процесса, создаваемого по шаблону
Функция СформироватьСводкуПоШаблону() Экспорт
	
	Результат = ШаблоныБизнесПроцессов.ПолучитьОбщуюЧастьОписанияШаблона(Ссылка);
		
	Если ЗначениеЗаполнено(НаименованиеБизнесПроцесса) Тогда
		Результат = Результат + НСтр("ru = 'Заголовок'") + ": " + НаименованиеБизнесПроцесса + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Описание) Тогда
		Результат = Результат + НСтр("ru = 'Описание'") + ": " + Описание + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Важность) Тогда
		Результат = Результат + НСтр("ru = 'Важность'") + ": " + Строка(Важность) + Символы.ПС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		Результат = Результат + Нстр("ru = 'Исполнитель'") + ": "
			+ Строка(Исполнитель)
			+ Символы.ПС;
	КонецЕсли;
	
	ДлительностьПроцесса = СрокиИсполненияПроцессов.ДлительностьИсполненияПроцесса(ЭтотОбъект);
	ДлительностьПроцессаСтрокой = СрокиИсполненияПроцессовКлиентСервер.ПредставлениеДлительности(
		ДлительностьПроцесса.СрокИсполненияПроцессаДни,
		ДлительностьПроцесса.СрокИсполненияПроцессаЧасы,
		ДлительностьПроцесса.СрокИсполненияПроцессаМинуты);
		
	Если ЗначениеЗаполнено(ДлительностьПроцессаСтрокой) Тогда
		Результат = Результат + Нстр("ru = 'Срок'") + ": "
			+ ДлительностьПроцессаСтрокой;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс_ПоддержкаМеханизмаОтсутствий

// Получает исполнителей
Функция ПолучитьИсполнителей() Экспорт
	
	МассивИсполнителей = Новый Массив;
	
	Если ЗначениеЗаполнено(Исполнитель) Тогда
		ДанныеИсполнителя = ОтсутствияКлиентСервер.ПолучитьДанныеИсполнителя(Исполнитель);
		МассивИсполнителей.Добавить(ДанныеИсполнителя);
	КонецЕсли;
	
	Возврат МассивИсполнителей;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда 
		ШаблоныБизнесПроцессов.НачальноеЗаполнениеШаблона(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда 
		Возврат;
	КонецЕсли;
	
	Если ШаблонВКомплексномПроцессе Тогда
		ПроверяемыйЭлемент = ПроверяемыеРеквизиты.Найти("Наименование");
		ПроверяемыеРеквизиты.Удалить(ПроверяемыйЭлемент);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ШаблоныБизнесПроцессов.ШаблонПередЗаписью(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
